<?php
/*
Template Name: 当サイトについて
*/
?>

<?php get_header(); ?>
<?php get_template_part('bread');?>

<div id="main">
	<div id="mainCrm">
	
	<div class="titleH2 greenType mt_0" id="about_us">
			<h2>当サイトについて</h2>
			<span class="icon-arrow-green"></span> </div>
			
			<p>リフォーム業者検索サイト「工事.com」（以下当サイト）は株式会社サクセスが運営するサイトです。<br>全面改装のリフォームから、増改築、場所別リフォーム（キッチン・洗面所等）まで、お客様のご要望に対応できるリフォーム会社（加盟店）を無料で探すことが出来るサイトです。</p>
		<div class="titleH2 mt_30">
			<h2>安心のリフォーム会社選び</h2>
		</div>
		
		<p>当サイトの加盟店に登録するには厳しい審査があります。また会社概要等の情報公開を義務付けておりますので、信用出来るリフォーム会社をお選び出来ます。しつこい電話や訪問等の営業活動もありませんのでご安心ください。</p>
		
		<div class="titleH2 mt_30">
			<h2>リフォーム会社詳細ページでより詳しく</h2>
		</div>
		
		<p>加盟リフォーム会社にはそれぞれ住所と電話番号を表示しておりますが、多数の加盟会社には多くの情報を備えた詳細ページがございます。会社概要、施工事例の写真、セールスポイント等をご覧いただけます。</p>

		<div class="titleH2 mt_30">
			<h2>気軽に一括見積りでじっくり比較検討</h2>
		</div>
		
		<p>適正なリフォーム代金はなかなか判断出来ません。お客様の要望にあったリフォーム会社を複数社選択して一括見積りを依頼することをお奨めいたします。他社見積り代金を参考に担当者と交渉することも可能です。</p>
		
		
		
		<div class="titleH2 greenType mt_50" id="company">
			<h2>運営会社情報</h2>
			<span class="icon-arrow-green"></span> </div>
		
		<div class="companyTable mt_30">
		<table class="detailTable">

<tr>
<th>会社名</th><td>株式会社サクセス</td>
</tr>
<tr>
<th>所在地</th><td>〒253-0032 神奈川県茅ヶ崎市常盤町1-29</td>
</tr>

<tr>
<th>電話番号</th><td>0120-918-784</td>
</tr>
<tr>
<th class="last">FAX番号</th><td class="last">0467-84-8096</td>
</tr>

</table>
</div>

<div class="titleH2 greenType mt_50" id="guide">
			<h2>ご利用ガイド</h2>
			<span class="icon-arrow-green"></span> </div>
			<div class="titleH2 mt_30">
			<h2>STEP1:リフォーム会社を選ぶ</h2>
		</div>
		
		<p>リフォームする箇所、内容、ご予算等をお決めください。<br>条件に合うリフォーム会社をお選びください。(*当サイトに加盟しているリフォーム会社は厳しい加盟店審査を合格し情報公開を義務付けた安心業者です)<br>お客様に比較・検討していただく為に、リフォーム会社（加盟店）毎の詳細ページがあります。会社概要、リフォーム事例、ホームページ等がご確認頂けますので安心です。<br>リフォーム箇所からリフォーム会社を検索する方法、地域（都道府県）から検索する方法、そしてリフォーム箇所と地域（同）両方で検索する方法があります。<br>そして、地域（都道府県）を第三候補まで検索したり、地域（区市町村）で更に絞り込む機能もありますので、ご希望のリフォーム会社候補をお選びください。</p>
		
		<div class="titleH2 mt_30">
			<h2>STEP2:お見積もりを受ける</h2>
		</div>
		
		<p>お選びになったリフォーム会社にメールにて内容を伝え、見積りを受けます。（*リフォーム会社への電話での相談、見積り依頼も可能です）<br>見積り依頼のメールは専用フォーマットをご用意しておりますので、簡単にご記入出来ますし、複数社へ一括送信が出来ます。<br>適正価格が分からない、より安価にリフォームされたい方には、複数社への見積り依頼をお薦め致します。</p>

		<div class="titleH2 mt_30">
			<h2>STEP3:リフォーム会社との契約 </h2>
		</div>
		
		<p>リフォーム会社を決められましたら契約をします。<br>工事内容、施工日、施工期間、契約金額等をリフォーム会社と確認することが大切です。そして確定しましたら契約します。</p>

		<div class="titleH2 mt_30">
			<h2>STEP4:施工　＞　工事完了とお引き渡し</h2>
		</div>
		
		<p>施工そして工事完了しましたら、工事責任者立会いの上不具合がないか必ず確認します。</p>
		
		
		<div class="titleH2 greenType mt_50" id="qa">
			<h2>よくある質問</h2>
			<span class="icon-arrow-green"></span> </div>
		
		<div class="titleH2 mt_30">
			<h2>ご利用方法について</h2>
		</div>
		<dl class="qa">
		<dt>工事.comとはどのようなサイトですか？</dt>
		<dd>当サイトは、全面改装のリフォームから、増改築、場所別リフォーム（キッチン・洗面所等）まで、お客様のご要望に対応できるリフォーム会社（加盟店）をご紹介(無料)するサイトです。
		</dd>
		<dt>全国どこでも利用が可能ですか？</dt>
		<dd>はい。
		</dd>
		<dt>どのようなリフォーム工事を申し込みできるのですか？</dt>
		<dd>全体リフォームから場所別リフォームまで対応いたします。</dd>
		
		<dt>利用に費用は発生しますか？</dt>
		<dd>いいえ。当サイトは全て無料でご利用できます。</dd>
		
		<dt>リフォーム会社を選ぶポイントは？</dt>
		<dd>リフォーム会社(加盟店)の会社情報に掲載しております、リフォーム事例等をしっかりご確認いただくことをお勧めいたします。<br>
		担当者からのご提案や回答を通じてお客様のご要望にあったリフォーム会社（加盟店）をお選び下さい。
		</dd>
		
		<dt>工事はどのくらいの期間かかりますか？</dt>
		<dd>工事内容と範囲により1日で完了する工事から数ヶ月以上かかる工事もございます。お客様のご要望の工事時期は早い段階でリフォーム会社(加盟店)にご相談いただくことをお勧めいたします。リフォーム会社(加盟店)からお客様のご要望の時期に合わせてご提案やお手続きを進めていくこともできます。
		</dd>
		
		<dt>工事後のトラブルについて</dt>
		<dd>工事後に何か気になる点がありましたら、工事を実施したリフォーム会社(加盟店)にご連絡をお願いいたします。</dd>
		
		<dt>加盟店（リフォーム会社）はどのように選んでいるのですか？</dt>
		<dd>加盟店申請の際に、企業概要・関連資格・関連法令の遵守・個人情報保護法の遵守等を登録基準とし審査しております。</dd>

<dt>（加盟店をしているお客様対象）<br />退会したいのですが、どうしたらよいでしょうか？</dt>
		<dd>当サイトのお問い合わせフォームを利用してご連絡ください。<br />（有料会員のお客様は契約更新日にお気をつけください）</dd>
		
		</dl>
		
		
		
		<div class="bnMain mt_40"><a href="http://s-zaiko.com/" target="_blank"><img src="<?php echo get_template_directory_uri(); ?>/common/images/bn_index01.png" alt="インターネット見積りお試しキャンペーン"></a></div>
	</div>
	<!--#mainCrm end-->

<?php get_sidebar("left"); ?>
		
	</div>
	<!--#subCrm end--> 
</div><!--main end-->
<?php get_footer(); ?>