<?php
/*
Template Name: ご利用規約
*/
?>

<?php get_header(); ?>
<?php get_template_part('bread');?>

<div id="main">
	<div id="mainCrm">
	
	<div class="titleH2 greenType mt_0" >
			<h2>ご利用規約</h2>
			<span class="icon-arrow-green"></span> </div>
			
			<div class="kiyakuArea">
工事.comは、株式会社サクセス（以下、当社という）が運営しております。本ページでは当サイトをご利用になる際に、事前にご了解いただく事項および参考説明を記載しています。<br>
各サービスの利用に際しては、当該サービスの利用規約に、あらかじめ同意していただく必要があります。<br>
※本ページに記載されている内容につきましては、予告なく変更されることがあります。変更された場合は、変更後の内容が直ちに適用されます。 


<h3>第1条利用者の責任</h3>
<ol>
<li>利用者は、真に取引する意思がある場合に本サービスを利用し、虚偽内容の登録を行わないものとします。</li>
<li>利用者は、情報発信機能を用いてリフォーム等の取引に関する正確かつ十分な情報を発信するものとします。</li>
<li>利用者は、リフォーム等の見積りの募集・依頼をキャンセルする場合、弊社が別途定める手続きに従うものとします。</li>
</ol>
<h3>第2条利用者情報の取扱</h3>
<ol>
<li>当社は、利用者がサイト利用の際に当社に届け出た事項および、サイト上で利用者に対し提供するサービスに関する事項について、本サービスを円滑に運用する目的で当社のデータベースに登録するものとします。また、利用者へはメールマガジンや各種お知らせ、新製品やサービスに関する情報等を送付することがあるます。</li>

<li>当社は前項で登録した情報を個人が識別不可能な状態で統計資料として活用ならびに公表することがあります。</li>

<li>本サービスを通じてリンクするサイトにおける個人情報の管理は、当該リンク先サイトの規定によるものとします。</li>
<li>個人情報の取扱いについては別途定める「プライバシーポリシー」によるものとします。</li>
</ol>

<h3>第3条当社から利用者への通知方法</h3>
<ol>
<li>当社から利用者に対する通知は、本規約に定めのある場合を除き、利用者があらかじめ当社に通知したアドレス宛の電子メール、サイト上の一般掲示 またはその他当社が適当と認める方法により送付されるものとします。なお、当社から通知されるメールには利用者のサイト利用状況の確認やその促進を目的としたものも含まれます。</li>
</ol>

<h3>第4条当社による商談メッセージの閲覧等</h3>
<ol>
<li>当社は、適切なサービス提供のため、利用者と加盟会社との商談メッセージを閲覧することができるものとします。なお、商談メッセージとは、当社が所有するシステム上で利用者と加盟会社との間で送受信されるメッセージをいいます。また必要に応じて、会員と加盟会社の間で締結された契約に関する見積書・発注 書・領収書の現物もしくはそのコピーの当社への提出を求めることがあるます。</li></ol>

<h3>第5条サービスの利用料金</h3>
<ol>
<li>加盟会社が提供するリフォーム等の代金、その算定方法および支払方法などは加盟会社が別途定める内容に従うものとします。</li>
<li>利用者と加盟会社との間で紛争が発生した場合は、当該当事者双方で解決するものとし、当社には一切責任がないものとします。</li>
</ol>

<h3>第6条加盟店の責任</h3>
<ol>
<li>加盟店は、リフォーム等の見積りへ応募・応答するにあたり、法令、その他行政機関の定める準則、ガイドライン等を遵守するものとし、その他本規約等に違反する行為を行ってはならないものとします。</li>
<li>加盟店は、リフォーム等の見積りへの応募・応答、あるいは弊社が運営するWebサイト等において、当社所定の方式によって定められたリフォーム等の内容以外の商品、工事、サービス等の情報を発信および掲示してはならないものとします。</li>
<li>加盟店は、情報発信機能を用いてリフォーム等の取引に関する正確かつ十分な情報を発信および掲示するものとします。</li>
<li>加盟店は、リフォーム等の見積り募集・依頼の内容に不明な点等があるときは、情報発信機能を用いて、自己の責任で募集・依頼する会員に確認するものとします。</li>
<li>加盟店は、リフォーム等または取引情報に関連して、他の利用者その他の第三者から、問合わせ、クレーム等があった場合、自己の責任で誠実にこれに対応するものとします。</li>
<li>加盟店は、リフォーム等または取引情報に関連して、弊社、他の利用者その他の第三者に、損害または不利益等を与えた場合、自己の責任と費用においてこれを賠償するものとします。</li>
</ol>

<h3>第7条利用者の責任</h3>
<ol>
<li>利用者は、本サービスの利用にあたり、以下の各号に定める行為を行ってはならないものとします。利用者がこれらの行為を行ったと当社が判断した場合、当社は、当該利用者に対する事前の通知なしに、当該利用者が掲示、発信した取引情報の削除、当該利用者による本サービスの全部または一部の利用停止、その他弊社が必要と判断する措置を講じることができるものとします。
<ol>
<li>本規約等に違反する行為</li>
<li>法令に違反する行為、法令違反を助長する行為またはそれらのおそれのある行為</li>
<li>真にリフォーム等の取引の意思がないにも関わらず、加盟店への見積りの募集・依頼または見積りへの応募・応答を行う行為</li>
<li>他の利用者、第三者または弊社の財産、名誉、信用、プライバシーもしくは著作権、パブリシティー権、商標権その他の権利を侵害する行為、侵害を助長する行為またはそれらのおそれのある行為</li>
<li>本サービスの利用に関連して知り得た弊社または他の利用者の秘密に属すべき情報を開示、公開する行為</li>
<li>本サービスを利用して他の利用者またはその他の第三者を他のWebサイトに誘導する行為</li>
<li>前各号の他、弊社が不適切と判断した行為</li>
</ol>
</li>
<li>前項の措置を講じたことにより、利用者に損害または不利益等が生じたとしても、弊社は一切の責任を負わないものとします。</li>
</ol>

<h3>第8条本サービスの中断</h3>
<ol>
<li>当社は、システムの保守、システム障害対応、天災等の不可抗力、その他技術上、運用上の理由により、本サービスの提供を中断する必要があると判断した場合、事前に利用者に通知することなく、本サービスの提供を一時的に中断できるものとします。</li>
<li>当社は、前項の措置に関連して、利用者に損害または不利益等が生じたとしても、一切の責任を負わないものとします。</li>
</ol>

<h3>第9条損害賠償</h3>
<ol>
<li>本サービスの提供・遅滞・変更・中断・停止・もしくは廃止、本サービスを通じて登録・提供される情報等の流出もしくは消失等、またはその他本サービスに関連して発生した利用者もしくは第三者の損害について、当社は一切の責任を負わないものとします。</li>
<li>利用者が本サービス利用によって第三者に対し損害を与えた場合、利用者は自己の責任と費用をもって解決し、当社に損害を与えることのないものとします。利用者が本規約に違反した行為または不正もしくは違法な行為によって当社に損害を与えた場合、当社は当該利用者に対して相応の損害賠償を請求できるものとします。</li>
<li>当社は、利用者に対して、適宜情報提供やアドバイスを行うことがありますが、これらの有用性を保証せず、これらに従った結果について一切の責任を負わないものとします。 </li>
<li>利用者には本規約等に同意の上、本サービスを利用していただいていますが、当社は利用者及び加盟会社の間で行われるリフォーム等の取引に関して、 利用者のためにいかなる保証も行いません。したがって、利用者の責任と判断により加盟会社を選択し、リフォーム等の取引を行うようにしてください。</li></ol>

<h3>第10条著作権</h3>
<ol>
<li>サイトに掲載の商品等の情報は、加盟会社および広告掲載会社の責任のもとに提供され、掲載の記事・写真・図表・データベースをはじめとするコンテンツの著作権は、当社および情報提供会社、その他権利者に帰属します。</li>
<li>他のホームページ、パソコン通信、イントラネット、電子メール、新聞・雑誌などへ無断転載することは全部・一部を問わず著作権侵害に該当しこれを禁止します。</li>
</ol>

<h3>第11準拠法、管轄裁判所</h3>
<ol>
<li>本規約等は日本法に基づき解釈されるものとし、本サービスに関連して訴訟の必要が生じた場合には、東京地方裁判所を第一審の専属的合意管轄裁判所とします。</li>
</ol>
制定：2015年4月1日

</div>
		
		
		<div class="bnMain mt_40"><a href="http://s-zaiko.com/" target="_blank"><img src="<?php echo get_template_directory_uri(); ?>/common/images/bn_index01.png" alt="インターネット見積りお試しキャンペーン"></a></div>
	</div>
	<!--#mainCrm end-->

<?php get_sidebar("left"); ?>
		
</div><!--main end-->
<?php get_footer(); ?>