<?php
/*
Template Name: プライバシーポリシー
*/
?>

<?php get_header(); ?>
<?php get_template_part('bread');?>
<div id="main">
	<div id="mainCrm">
	
	
	<div class="titleH2 greenType mt_0" >
			<h2>プライバシーポリシー</h2>
			<span class="icon-arrow-green"></span> </div>
			
			<p class="mt_20">「株式会社サクセス」（以下、「当社」といいます）ではお問い合わせの際に、お客様の氏名、住所、電話番号、e-mailアドレスなどご連絡に必要な情報（以下「個人情報」といいます）を開示していただきます。
当社は、個人情報保護法の趣旨のもと、このプライバシーポリシーに則って個人情報を取り扱います。
このプライバシーポリシーは、当社が開示いただいた個人情報の取扱いに関するお客様と当社との間のお約束です。</p>
			
			<div class="titleH2 mt_30">
			<h2>1.個人情報の利用目的について</h2>
		</div>
			<p>当社は個人情報を以下の目的で利用させていただきます。<br>
			お客様へのご連絡のためにお客様の氏名、住所、電話番号などの連絡先情報を利用します。<br>
			お申し込みの内容などを連絡したり確認するために、お客様の氏名、住所、e-mailアドレスなどの連絡先情報などの情報を利用します。<br>
			お客様に当社が行うサービスのご案内をするために、ご利用された履歴や、お客様の氏名、住所、e-mailアドレスなどの連絡先情報を利用します。<br>
			当社のお客様から寄せられたご意見やご利用履歴などを利用します。<br>
			お客様からのご要望、お問い合わせに対する回答をするために、お客様の氏名、住所、e-mailアドレスなどの連絡先情報を利用します。</p>
			
			
			
			<div class="titleH2 mt_30">
			<h2>2.個人情報の管理について</h2>
		</div>
			<p>当社は以下の体制で個人情報を管理します。<br>
			個人情報保護法やガイドラインに従って必要な体制を整備し、スタッフから個人情報の取扱を適正に行う旨の誓約書を取得します。<br>
			個人情報の利用を業務上必要な社員だけに制限し、個人情報が含まれる媒体などの保管・管理などに関する規則を作り、個人情報保護のための予防措置を講じます。<br>
			システムに保存されている個人情報については、業務上必要なスタッフだけが利用できるようアカウントとパスワードを用意し、アクセス権限管理を実施します。なお、アカウントとパスワードは漏えい、滅失のないよう厳重に管理します。<br>
			サービスに支障が生じないことを前提として、個人情報の受領時から一定期間経過後、個人情報は随時削除していきます。</p>

<div class="titleH2 mt_30">
			<h2>3.個人情報の開示、訂正、追加、利用停止、消去について</h2>
		</div>
			<p>当社に保有されているお客様の個人情報について、お客様ご自身が、開示、訂正、追加、利用停止、消去の各請求を要望される場合は、当社まで直接ご請求下さい。個人情報漏洩防止、正確性、安全性の確保の観点から、法令の規定により特別な手続が定められている場合を除き、遅滞なく必要な調査を行い、当該ご請求がお客様ご自身によるものであることが確認できた場合に限り、法令の定めに基づき遅滞なくお客様の個人情報の開示、訂正、追加、利用停止、消去を行います。<br>
上記の開示等の実施、不実施については、ご請求のあったお客様に対して遅滞なくご連絡いたします。なお、不実施の場合は、その理由を説明するよう努めます。
</p>

<div class="titleH2 mt_30">
			<h2>4.個人情報提供先への個人情報の提供について</h2>
		</div>
			<p>個人情報提供先に提供するお客様の個人情報の範囲は、お客様から特に申し入れがある場合を除いて、全ての個人情報を対象とします。<br>
個人情報提供先へのお客様の個人情報の提供は、紙、電子データの伝送、磁気テープの引渡し、サーバへのアクセスのいずれかの方法で行います。<br>
お客様ご自身より、個人情報提供先への提供を停止するようご請求があったときは、法令の定めに基づき遅滞なくお客様の個人情報の個人情報提供先への提供を停止します。<br>
上記の停止の実施、不実施については、ご請求のあったお客様に対して遅滞なくご連絡します。なお、不実施の場合は、その理由を説明するよう努めます。

</p>

<div class="titleH2 mt_30">
			<h2>5.関係法令及びその他の規範の遵守</h2>
		</div>
			<p>当社は、お客様の個人情報に関係する日本国の法令を遵守します。

</p>



		
		<div class="bnMain mt_40"><a href="http://s-zaiko.com/" target="_blank"><img src="<?php echo get_template_directory_uri(); ?>/common/images/bn_index01.png" alt="インターネット見積りお試しキャンペーン"></a></div>
	</div>
	<!--#mainCrm end-->

<?php get_sidebar("left"); ?>
		
</div><!--main end-->
<?php get_footer(); ?>